In [5]:
import pandas as pd

df = pd.DataFrame([[1, 2], [3, 4]], columns=['a', 'b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns=['a', 'b'])
df3=pd.concat([df,df2])

In [6]:
df3

   a  b
0  1  2
1  3  4
0  5  6
1  7  8

In [24]:
import pandas as pd

df = pd.DataFrame([[1, 2], [3, 4]], columns = ['a','b'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['c','d'])

df3=pd.concat([df,df2])
# Drop rows with label 0
df3 = df3.drop(1)

df3
#if col index varies then output also varies i.e if both df have same value only label will deleted else the other will be NaN &

     a    b    c    d
0  1.0  2.0  NaN  NaN
0  NaN  NaN  5.0  6.0

In [13]:
import pandas as pd

df = pd.DataFrame([[1, 2], [3, 4]], columns = ['c','d'])
df2 = pd.DataFrame([[5, 6], [7, 8]], columns = ['c','d'])


# Drop rows with label 0
df = df.drop(0)

df

   c  d
1  3  4

In [8]:
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
print (df)

     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [26]:
#slicing
import pandas as pd

d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']), 
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df[2:4]

   one  two
c  3.0    3
d  NaN    4

In [31]:
# creating an empty panel
import pandas as pd
import numpy as np

data = np.random.rand(2,4,5)
p = pd.Panel(data)
print(p)

AttributeError: module 'pandas' has no attribute 'Panel'

import pandas as pd
p = pd.Panel()
print p

In [32]:
#panel classhas removed
import pandas as pd
p = pd.Panel()
print (p)

AttributeError: module 'pandas' has no attribute 'Panel'

In [33]:
#to create panel i.e multidimensional array
import pandas as pd
import numpy as np

# Create a MultiIndex DataFrame with random data
arrays = [np.array(['item1', 'item2', 'item3']),
          pd.date_range('2022-01-01', periods=4),
          ['A', 'B', 'C', 'D', 'E']]

data = np.random.rand(3, 4, 5)
df = pd.DataFrame(data.reshape(3, -1), index=pd.MultiIndex.from_arrays(arrays, names=('items', 'date', 'letters')))

print(df)

ValueError: all arrays must be same length

In [35]:
import pandas as pd
import numpy as np

# Create a MultiIndex DataFrame with random data
arrays = [np.array(['item1', 'item1', 'item1', 'item2', 'item2', 'item2', 'item3', 'item3', 'item3']),
          np.tile(pd.date_range('2022-01-01', periods=4).tolist(), 3),
          np.tile(['A', 'B', 'C', 'D', 'E'], 3)]

data = np.random.rand(9, 5)  # Adjust the shape to match the length of the MultiIndex
df = pd.DataFrame(data, index=pd.MultiIndex.from_arrays(arrays, names=('items', 'date', 'letters')), columns=['value'])

print(df)

ValueError: all arrays must be same length

In [39]:
# creating an empty panel
import pandas as pd
import numpy as np
data = {'Item1' : pd.DataFrame(np.random.randn(4, 3)), 
   'Item2' : pd.DataFrame(np.random.randn(4, 2))}
p = pd.Panel(data)
print( p.minor_xs(1))

AttributeError: module 'pandas' has no attribute 'Panel'

In [40]:
!dir

 Volume in drive C has no label.
 Volume Serial Number is CC3E-6226

 Directory of C:\Users\NIGHT SHIFT\Desktop\ll

01/08/2024  12:21 PM    <DIR>          .
01/08/2024  12:21 PM    <DIR>          ..
01/08/2024  11:29 AM    <DIR>          .ipynb_checkpoints
01/04/2024  04:27 PM             3,004 D1.ipynb
01/05/2024  12:30 PM             3,714 D2.ipynb
01/08/2024  12:13 PM            22,234 D3.ipynb
05/30/2022  10:44 AM            11,425 people-100.csv
01/04/2024  03:52 PM    <DIR>          Untitled Folder
01/08/2024  11:29 AM            24,393 Untitled.ipynb
               5 File(s)         64,770 bytes
               4 Dir(s)  135,682,772,992 bytes free

In [41]:
df=pd.read_csv("people-100.csv")
df

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
1,2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
2,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
3,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
4,5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon
...,...,...,...,...,...,...,...,...,...
95,96,5eFda7caAeB260E,Dennis,Barnes,Female,bmartin@example.org,001-095-524-2112x257,1954-07-30,Software engineer
96,97,CCbFce93d3720bE,Steve,Patterson,Female,latasha46@example.net,001-865-478-5157,1932-04-29,Barrister
97,98,2fEc528aFAF0b69,Wesley,Bray,Male,regina11@example.org,995-542-3004x76800,1994-12-28,Police officer
98,99,Adc7ad9B6e4A1Fe,Summer,Oconnell,Female,alexiscantrell@example.org,001-273-685-6932x092,2012-04-12,Broadcast journalist
99,100,b8D0aD3490FC7e1,Mariah,Bernard,Male,pcopeland@example.org,(341)594-6554x44657,2016-11-15,IT sales professional

In [42]:
df.columns

Index(['Index', 'User Id', 'First Name', 'Last Name', 'Sex', 'Email', 'Phone',
       'Date of birth', 'Job Title'],
      dtype='object')

In [43]:
len(df.columns)

9

In [46]:
df2=df.columns[0:3]
df2

Index(['Index', 'User Id', 'First Name'], dtype='object')

In [47]:
df3=df[['Index','User Id', 'First Name']]
df3

    Index          User Id First Name
0       1  88F7B33d2bcf9f5     Shelby
1       2  f90cD3E76f1A9b9    Phillip
2       3  DbeAb8CcdfeFC2c   Kristine
3       4  A31Bee3c201ef58    Yesenia
4       5  1bA7A3dc874da3c       Lori
..    ...              ...        ...
95     96  5eFda7caAeB260E     Dennis
96     97  CCbFce93d3720bE      Steve
97     98  2fEc528aFAF0b69     Wesley
98     99  Adc7ad9B6e4A1Fe     Summer
99    100  b8D0aD3490FC7e1     Mariah

[100 rows x 3 columns]

In [48]:
df3=df[[0:3]]
df3

SyntaxError: invalid syntax (648826251.py, line 1)

In [49]:
df.head()

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
0,1,88F7B33d2bcf9f5,Shelby,Terrell,Male,elijah57@example.net,001-084-906-7849x73518,1945-10-26,Games developer
1,2,f90cD3E76f1A9b9,Phillip,Summers,Female,bethany14@example.com,214.112.6044x4913,1910-03-24,Phytotherapist
2,3,DbeAb8CcdfeFC2c,Kristine,Travis,Male,bthompson@example.com,277.609.7938,1992-07-02,Homeopath
3,4,A31Bee3c201ef58,Yesenia,Martinez,Male,kaitlinkaiser@example.com,584.094.6111,2017-08-03,Market researcher
4,5,1bA7A3dc874da3c,Lori,Todd,Male,buchananmanuel@example.net,689-207-3558x7233,1938-12-01,Veterinary surgeon

In [50]:
df.tail()

,Index,User Id,First Name,Last Name,Sex,Email,Phone,Date of birth,Job Title
95,96,5eFda7caAeB260E,Dennis,Barnes,Female,bmartin@example.org,001-095-524-2112x257,1954-07-30,Software engineer
96,97,CCbFce93d3720bE,Steve,Patterson,Female,latasha46@example.net,001-865-478-5157,1932-04-29,Barrister
97,98,2fEc528aFAF0b69,Wesley,Bray,Male,regina11@example.org,995-542-3004x76800,1994-12-28,Police officer
98,99,Adc7ad9B6e4A1Fe,Summer,Oconnell,Female,alexiscantrell@example.org,001-273-685-6932x092,2012-04-12,Broadcast journalist
99,100,b8D0aD3490FC7e1,Mariah,Bernard,Male,pcopeland@example.org,(341)594-6554x44657,2016-11-15,IT sales professional

In [51]:
df.describe()

            Index
count  100.000000
mean    50.500000
std     29.011492
min      1.000000
25%     25.750000
50%     50.500000
75%     75.250000
max    100.000000

In [53]:
df[['User Id']]

            User Id
0   88F7B33d2bcf9f5
1   f90cD3E76f1A9b9
2   DbeAb8CcdfeFC2c
3   A31Bee3c201ef58
4   1bA7A3dc874da3c
..              ...
95  5eFda7caAeB260E
96  CCbFce93d3720bE
97  2fEc528aFAF0b69
98  Adc7ad9B6e4A1Fe
99  b8D0aD3490FC7e1

[100 rows x 1 columns]

In [54]:
df['User Id']

0     88F7B33d2bcf9f5
1     f90cD3E76f1A9b9
2     DbeAb8CcdfeFC2c
3     A31Bee3c201ef58
4     1bA7A3dc874da3c
           ...
95    5eFda7caAeB260E
96    CCbFce93d3720bE
97    2fEc528aFAF0b69
98    Adc7ad9B6e4A1Fe
99    b8D0aD3490FC7e1
Name: User Id, Length: 100, dtype: object

In [55]:
df['User Id'].describe()

count                 100
unique                100
top       88F7B33d2bcf9f5
freq                    1
Name: User Id, dtype: object

In [56]:
df.dtypes

Index             int64
User Id          object
First Name       object
Last Name        object
Sex              object
Email            object
Phone            object
Date of birth    object
Job Title        object
dtype: object

In [59]:
df.Phone=df.Phone.astype(str)

In [62]:
type(df['Phone'][0])

str

In [65]:
(df['Index'][0:5])

0    1
1    2
2    3
3    4
4    5
Name: Index, dtype: int64

In [66]:
df.Index=df.Index.astype(str)

In [67]:
df.dtypes

Index            object
User Id          object
First Name       object
Last Name        object
Sex              object
Email            object
Phone            object
Date of birth    object
Job Title        object
dtype: object

In [80]:
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)
df

ValueError: could not convert string to float: 'Alex'

In [81]:
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
df['Age'] = df['Age'].astype(float)
df

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

In [82]:
type(df.Age[0])

numpy.float64